prst/TM4C1294/TM4C1294_leds.c
	if (timeout == 0xFFFF) {
		// The PLL never locked or is not powered.
		// Skip the rest of the initialization, leaving the system clocked from the MOSC,
		// which is a 25 MHz crystal.
		return;
	}

	// 9)Write the SYSCTL_RSCLKCFG_R register's PSYSDIV value, set the USEPLL bit to
	//   enabled, and set the MEMTIMU bit.
	SYSCTL_RSCLKCFG_R =
		(SYSCTL_RSCLKCFG_R & ~SYSCTL_RSCLKCFG_PSYSDIV_M) + (PSYSDIV & SYSCTL_RSCLKCFG_PSYSDIV_M) |
		SYSCTL_RSCLKCFG_MEMTIMU |
		SYSCTL_RSCLKCFG_USEPLL;
}
//******************************************************************************



//******************************************************************************
//debug code
//******************************************************************************
// delay function for testing from sysctl.c
// which delays 3*ulCount cycles
// ... Delay(16666667); // delay ~1 sec @ 50 MHz
// ... Delay(2000000);  // delay ~0.05 sec @ 120 MHz (0.375 sec @ 16 MHz; 0.078125 sec @ 76.8 MHz)
#ifdef __TI_COMPILER_VERSION__
	void Delay (uint32_t ulCount) {        // @ Code Composer Studio Code
		__asm (
		  " subs    r0, #1 \n "
		  " bne     Delay \n "
		  " bx      lr \n "  );
		//while (ulCount-->0) {};
	}
#else
	__asm void Delay (uint32_t ulCount) {  // @ Keil uVision Code
		subs    r0, #1
		bne     Delay
		bx      lr    }
#endif // #ifdef __TI_COMPILER_VERSION__
//******************************************************************************



//******************************************************************************
//#define NVIC_ST_CTRL_R          (*((volatile unsigned long *)0xE000E010))
//#define NVIC_ST_RELOAD_R        (*((volatile unsigned long *)0xE000E014))
//#define NVIC_ST_CURRENT_R       (*((volatile unsigned long *)0xE000E018))
#define NVIC_ST_CTRL_COUNT      0x00010000  // Count flag
#define NVIC_ST_CTRL_CLK_SRC    0x00000004  // Clock Source
#define NVIC_ST_CTRL_INTEN      0x00000002  // Interrupt enable
#define NVIC_ST_CTRL_ENABLE     0x00000001  // Counter mode
#define NVIC_ST_RELOAD_M        0x00FFFFFF  // Counter load value
//******************************************************************************
// Initialize SysTick with busy wait running at bus clock.
//******************************************************************************
void drv_sys_init_SysTick ( void ) {
  NVIC_ST_CTRL_R    = 0;                    // disable SysTick during setup
  NVIC_ST_RELOAD_R  = NVIC_ST_RELOAD_M;     // maximum reload value
  NVIC_ST_CURRENT_R = 0;                    // any write to current clears it
										    // enable SysTick with core clock
  NVIC_ST_CTRL_R    = NVIC_ST_CTRL_ENABLE + NVIC_ST_CTRL_CLK_SRC;
}
//******************************************************************************



//******************************************************************************
// Time delay using busy wait.
// The delay parameter is in units of the 6 MHz core clock. (167 nsec)
//******************************************************************************
void SysTick_Wait ( unsigned long delay ) {
  volatile unsigned long  elapsedTime;
  unsigned long           startTime = NVIC_ST_CURRENT_R;
  do {
    elapsedTime = ( startTime-NVIC_ST_CURRENT_R ) & 0x00FFFFFF;
  }
  while ( elapsedTime <= delay );
}
//******************************************************************************



//******************************************************************************
// Time delay using busy wait.
// 10000us equals 10ms
//******************************************************************************
void SysTick_Wait_10ms ( unsigned long delay ) {
  unsigned long  i;
  for ( i=0; i<delay; i++ ) {
    SysTick_Wait ( 60000 );  // wait 10ms (assumes 6 MHz clock)
  }
}
//******************************************************************************



//******************************************************************************
extern int snake_main ( void ) ;

extern uint32_t  u32_rtc_time;
extern uint32_t  u32_rtc_date;
t_io_values      io  = {0};
t_sys_values     sys = {0};
t_io_Snake       s_snake = { .algo_step = S_INIT };


/* *****************************************************************************
 * Blinks on the leds and indicator.
 * ************************************************************************** */
int main (void) {
              //uint8_t    rc=1;
              uint8_t    comma;
              uint8_t   *p_str=0;
    volatile  uint32_t   pos;
    volatile  uint32_t   cnt=0;

    //SysCtlClockSet(SYSCTL_SYSDIV_10 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN | SYSCTL_XTAL_16MHZ);

    drv_sys_init_SysTick ();
    drv_sys_init_pll ();
    drv_sys_init_gpio_output_input ();
    drv_usr_init_led_7segments ();
    drv_usr_init_led_8x8 ();
    drv_usr_init_rtc ();
    drv_usr_init_scheduler_end_timers ();

    leds_position = 1;
    io.in = 0.0001; // Set to default value

	while (1) { // Loop forever.
	//	drv_led_blink (); // timer_leds4on.common_rule

		//if (sys.key_pressed==0)
		//	drv_led_7segments_clean();
		//else
		if ( _TIMER_READY == delay_timer ( leds5x8, '?' ) ) {
			if ( pos < 5 ) {
				p_str = ftostr ( io.in, data, 10, &comma ); // value, *ptr, base, *comma
				if (p_str!=NULL) {
					drv_led_7segments_symbol ( pos, data[pos], comma ); // display info
					drv_led_7segments_position ( pos ); // dinamic switching
					//drv_led_8x8_pixel_set ( io.x, io.y, 0 ); // display info
				}
				pos++;
				cnt++;
    		} else pos=0;
    	}

		if ( _TIMER_READY == delay_timer ( keys, '?' ) ) {
			keys_scan ( &io );
			keys_analyze ( &io, &sys );
			if ( sys.key0 ||sys.key1 ||sys.key2 ||sys.key3 ||sys.key4 ||sys.key5 ) {
				sys.key_pressed=1;
				if (sys.key5) { if ( io.in < 99999 ) io.in += 0.001; }
				if (sys.key4) { if ( io.in > 0 )     io.in -= 0.001; }
				if (sys.key3) { if ( io.in < 99999 ) io.in += 0.01; }
				if (sys.key2) { if ( io.in > 0 )     io.in -= 0.01; }
				if (sys.key1) { if ( io.in < 99999 ) io.in += 0.1; }
				if (sys.key0) { if ( io.in > 0 )     io.in -= 0.1; }
				//srand ( (char)io.in ); // Initiate seek random number
				//s_snake.rnd = rnd_fill_field( (io.in)*100 );
			} else {
				sys.key_pressed=0;
			}
		}

		if ( _TIMER_READY == delay_timer( leds8x8, '?' ) ) {
			//int  rc;
			//rc = snake_main();

			if ( RC_OK != algo_Snake (&io, &s_snake) ) { error_forever_loop; }

			/*  char  yy=0;
			float val=0;
			rc = fft_calc();
			if ( yy<16 ) {
				//val = abs(buf_out[yy]*10);
				if ( buf_out[yy] <0 ) {  val = -1*(buf_out[yy] * 10000);
				} else {                 val =    (buf_out[yy] * 10000); }
				drv_led_8x8_show_byte( (uint8_t)val, xx, yy );
				yy++;
			} else {
				yy=0;
			}  */
		}

		/*  if ( _TIMER_READY == delay_timer ( rnd, '?' ) ) {
			if ( ++io.rnd>7 ) io.rnd=0;

			u32_rtc_time = HIB_CAL0_R;  //Read RTC Time
			u32_rtc_date = HIB_CAL1_R;  //Read RTC Date
		}  */

		if ( _TIMER_READY == delay_timer ( mouse, '?' ) ) {
			//mouse_main();
    		GPIO_PORTN_DATA_R ^= 0x02;    // Toogle on the LED.
		}
	}

	//return rc;
}
//******************************************************************************
